[["Cyber Security Practice Lead", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=WljrD__PLUS__VL__SLASH__ntzpSvf__PLUS__uAgZw==&bc=EXT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "Responsibilities include, but are not limited to: Candidate will take ownership of growing and managing this practice, thereby helping in the growth of our overall Cybersecurity Practice. Candidate will develop and execute an aggressive growth strategy, bring new ideas, concepts and solutions to our clients based on understanding of the markets evolving needs and objectives. Identify, develop and execute client proposals Ensures that quality standards are practiced in the course of providing client service. Review documentation and client reports as necessary, resolving any problems during the engagements. Works within budgetary and time constraints while providing high-level client satisfaction. Anticipate and address client concerns and escalate problems as they arise. Maintains excellent relationships with our MDR clients. Lead, coach and mentor teams, providing guidance, support and resources for professional and career growth and development. Maintain comprehensive knowledge of Cybersecurity risks, best practices and operating frameworks. Must have experience, skills & capabilities related to: Experience: 10-15 years working with established cyber security services (MSSP/MDR) or in CISO offices of large organizations or related to Cybersecurity consulting. Strategic business development including orchestrating and executing client business development plans or development, communication and execution of a growth strategy for managed security services. Experience of conceptualizing service offerings and taking to market Ability to lead customer discussions with thought leadership Develop & maintain client relationships and manage all aspects of an engagement. Ability to articulate cyber issues in context of the business risks. Comprehensive understanding of the Cybersecurity industry, risks, regulations and technology solutions. Solid understanding of Security Operations Center (SOC) management / Managed Detection and Response (MDR) operations. Building a dedicated and motivated team of Cybersecurity consultants Lead the operating group & integrate and leverage thought leadership efforts. Strong communication skills, executive presence and ability to build relationships at all levels. Technical Skills needed: Industry accredited Cyber security/IT security certifications Hands-On with deployment and management of endpoint security solutions (Anti-Malware, EDR, DLP, File Integrity Monitoring, vulnerability management) Good understanding of how to leverage Threat Intel & Threat Hunting procedures Understanding of Cyber security frameworks like MITRE ATT&CK and CIS controls Hands on with different OSINT tools Understanding of different attack vectors and use of forensic and monitoring tools like volatility, osquery, Sysmon for incident investigation Experience with different SIEM technologies Moderate to high level of programming expertise with languages like Python will be an added advantage Job Features Job Category Engineering Experience 10 Years Educational Qualification Bachelor in Computer Science, Computer Engineering, Software Engineering or related fields", "ASM Technologies Limited", "Bengaluru / Bangalore", null, "forensic, software engineering, press, IT security, endpoint security, siem, security, security operations center, cyber security, information security, dlp, vulnerability management, infrastructure", "Jun 10, 2023 12:00:00 AM", "timesjobs", "10 - 15 yrs"], ["Cyber Security Test Engineer", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=l0NkFhYjmsdzpSvf__PLUS__uAgZw==&bc=EXT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "Job Description Summary Responsible as a Cyber Security Software Test Engineer for Engine / Transmission / Hybrid / Electric Vehicle applications involving Electronic Control Modules and ASICs for Engine, Transmission, Inverters, Motors, Batteries on a HIL environment at various SW level (BSW/ASW/FS/CS) Will be part of a multi-cultural, multi-disciplinary product development and testing team working on projects involving multiple locations. Job Description Analyze and understand Vehicle level architecture and product schematic designs Analyze and understand the Functional Requirements/ Design Requirements and develop SWE.5 & SWE.6 Test Cases as per ASPICE process Create Simulation and Automation Framework to perform HIL testing Create HIL Test Plan, Test Cases and Automation procedures / scripts from Functional Requirements / Design Architecture Document. Perform Software Functional Test on HIL Setup. Develop and maintain HIL automation capability for continuous integration and validation Report SW and HW failures to development team and track them to closure. Work Experience / Skills Basic knowledge of Microcontroller Hardware, Motors, Automotive & Power Electronics, Electrical circuits, ICE & Electric Vehicle Features. Experience in Vehicle Powertrain/EV Testing Preferred Tools knowledge : Lauterbach Debugger, CANoE with CAPL Scripting, CANape, TraceTronic - ECU Test, NI LABVIEW, NI VERISTAND, TESTSTAND, DIAGRA, ETAS INCA, Control Desk NG, Configuration Desk NG, JIRA, Polarion, BitBucket & Plastic SCM Knowledge of Automotive communication protocols like CAN FD, LIN & Flexray Protocols Knowledge of automotive ASPICE Standard for SW Application, Functional Safety & Cybersecurity. Cyber Security o Knowledge about Cybersecurity Automotive Standard ISO 21434. o Hands on experience on Penetrating testing, Fuzz testing and Vulnerability analysis. o Knowhow to comprehend CS requirements related to HSM/Encrypt/Cybercomm services & device methods to test requirements. o Experience in CS L2/L3 SWE.5 & SWE.6 Test Case Development, Execution & Automtation o Detailed knowledge on understanding the CS requirements (ADA, Secure Boot, Authenticated Diagnostics, JTAG, HSM, Secure Logging, Secure Lifecycle, Vehicle Key Management, Immoblizer, Variant Coding & MSS) o Expertise in developing negative test scenarios. o Good hands on experience with Debugger & Vector CANoe o Expertise in CAPL Programming. Good knowledge of C language, Python & MATLAB Simulink/Simscape Models Knowledge of test methods and test management tools Domain Expertise in Engines / Transmission systems / Electric Drives / Battery Management System / Vehicle Dynamics Strong interpersonal skills and high intercultural social competence. Good verbal and written communication skills to work effectively with teams spread geographically and Agile in approach Good analytical and problem solving capability", "BorgWarner Inc.", "Bengaluru / Bangalore", null, "continuous integration, test management, debugger, software test engineer, jira, testing, test case development, test engineer, l2 / l3, logging, agile, automation framework, technical leader, test cases, test scenarios, c, written communication", "Jul 9, 2023 12:00:00 AM", "timesjobs", "2 - 6 yrs"], ["Sales Engineer | Cyber Security", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=KhX0G17qUp5zpSvf__PLUS__uAgZw==&bc=EXT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "We are looking for an ambitious & ready to leverage the learning environment in a fast-growing global leader in information and cyber security. The candidate should have an understanding of key technologies/solutions in software development and an awareness of top Security applications. The ideal candidate would have good learning agility and would keep themselves informed of the latest in technology. OKey Responsibilities: To deliver innovative sales and marketing strategies to increase profitability in assigned territory and accounts. Must have Pre sales technical presentations/ demos to potential customers and partners during product launches or initial engagement. To Initiate pre sales activities, consulting services and products developed projects scopes and prepare proposals. Shall work as company's representative for client interaction, performed market research to prospect the target markets, prepared case studies, presentations, periodic sales report for business growth analysis. To Prepare client proposals, RFPs and RFQs, sales and marketing collaterals and also provided post-proposal support during entire sales cycle. To Create internal software requests and POC implementation plans and monitor the approval process Prepare software order forms. Co-coordinating with the creation of a sales cycle plan Assists customer, prospect and Sales Representative to build a compelling and competitive business case and ROI. To introduce various customers to changing product markets and feasible implementations for Software Security products. To manage hand-over to the Services Functions (Post-Sales Support and Professional Services) for live project implementation.", "CODEC Networks", "Mumbai,  Delhi,  Delhi/NCR,  Pune,  Bengaluru / Bangalore", null, "sales goals, sells, client relationships, sales, market, negotiation, sales planning, fmcg", "Jun 9, 2023 12:00:00 AM", "timesjobs", "0 - 3 yrs"], ["Cyber Security Lead Engineer-Systems", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=c1xHABxtf5lzpSvf__PLUS__uAgZw==&bc=EXT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "Power Drive Systems : Cyber Security Lead Engineer Location : Tech Center , Bangalore (earlier Delphi Technologies) Basic Qualifications 7 years of experience in a product cybersecurity position or 10 years in an embedded systems/software competency with a strong interest in cybersecurity Knowledge of Automotive cybersecurity standards are strongly advised. Responsible to carry our risk assessment (TARA) on ECU's and associated functions/feature Major Job Responsibilities: Being passionate and forward-thinking about cybersecurity and the needs for the ever-changing automotive industry. Plans and implements the cybersecurity activities with a given project with acollaborative team that takes into consideration customer specifications, the cybersecurity process and can bring their own experience into what is needed Performs cybersecurity risk assessments and threat modelling within a product scope and suggests countermeasures appropriate to the project given the technical constraints or operational limitations Knowledge of regulations/standards (SAE/ISO) and associated regulatory frameworks such as ISO 21434, SAE 3061 and UNECE WP29 Knowledge of software signing, secure boot and associated cryptographic techniques. Designs and leads the cybersecurity technical solutions as required by the project working with hardware and software teams as needed for the best solutions. Follows and contributes to the secure development lifecycle at BorgWarner For a project that has been deemed cyber-relevant, they will create a cybersecurity assurance case that provides the argument for the achieved degree of cybersecurity on their project Drives feature development and provides technical support for hardware and software teams, including but not limited to Immobilisers/anti-theft devices Manipulation Detection Watchdogs (software or hardware) Secure/Authenticated/Trusted Boot methods Key management best practices within products Secure on-board communication (SecOC or similar) Secure diagnostics (token-based or other methods) Understanding hardware trust anchors (microcontroller HSMs, HTAs etc Active/Passive Side Channel attacks and countermeasures Interfaces with customer on technical cybersecurity issues. Follows and keeps up to date with vulnerabilities of our suppliers/customers Networks and maintains a high-level of industry knowledge Understanding of public key infrastructure (PKI) in medium to large environments to Works directly with Cybersecurity Managers to provide cybersecurity support on projects Preferred Qualifications: Understanding of public key infrastructure (PKI) in medium to large environments to include key management, digital certificates and digital signatures as these impacts the systems we build. Familiarity with automotive network architecture, modules, and protocols (CAN, Flexray etc.) is desired but can be transferrable if there is knowledge of ethernet and or the OSI model. Understanding of multi-core embedded microcontrollers that use HTAs (hardware trust anchors). Familiarity of module-based architectures such as AUTOSAR. Strong communication and analytical skills Ability to work independently, take ownership of project deliverables, go above and beyond the task at hand Familiarity with Secure Coding practices, processes and methods. This can include some understanding of the dangers of using C, MISRA and CertC if possible. Understanding of different types of penetration and fuzz testing and the tools to do this effectively for our products. An idea of which methods to apply in each project is needed. Holding cybersecurity certifications such as CISSP, CEH or SANS GMOB/GPEN is advantageous but not necessary because passion is more important.", "BorgWarner Inc.", "Bengaluru / Bangalore", null, "embedded systems, ecu, hardware, flexray, autosar, microcontroller", "Jul 9, 2023 12:00:00 AM", "timesjobs", "10 - 13 yrs"], ["Cabin crew fresher candidate , passport checker", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=OAemTD9iEPhzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "Airport jobs in all StateHR MR Rahul Mishra 9456596266 (Call And drop your cv on this WhatsApp 9456596266 )We are looking for candidates for Airport Ground Staff , ticket checking,cabin crew ect0 years of experience. Candidates who have prior experience in full TimeJob :- Airline Ground Staff job requires Responsibility, Ground Support Equipment, Ground Transportation, Airport Management, Flight Planning in skills.-High school equivalent qualification. Checking passengers in giving seat numbers Providing boarding passes and luggage labels. Telling passengers about luggage restrictions. Weighing baggage and collecting any excess weight charges. Taking care of people with special needs.CheckthisPost--Flight Steward, HR, Cashier, Supervisor, Manager , Announcer, Air Ticketing, Ground Handling, C.S.A, G.R.E, Welcome Loader, G.R.A, Tag Boy, Kitchen Steward. DATA entry, back office, HOUSEKEEPING, Floor Manager, Event Planner, Engineer, Transport Supervisor, Waiter/Steward. HR/Admin, Help Desk Executive ,FIRE FIGHTER , BARTENDER, AIR HOSTESS, Trainer, COOK, COUNSELLER, WAREHOUSE EXECUTIVE ,HR, MANAGER, SUPERVISOR, AIR TICKETING CASHIER ACCOUNTANTQualification-10th, 12th to Graduate (Hospitality, Aviation, must apply) and good Air-ticketing Executive Reservation Executive Passport Checking Staff Baggage/Security Guest Relationship Executive Customer Service Associate Cabin Crew Ground staff -Startingsalary 27500/- TO 49500/-EDUCATION DETAILS- 10th /12th PASS AND ABOVE CAN APPLYNOTE-> WE ARE NOT A CONSULTANCY>DIRECT COMPANY PAYROLLFULL-TIME PERMANENT Job details call airline HR Mr Rahul Mishra call or follow the WhatsApp number 9456596266", "HM Job Hub", "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", null, "Data Entry, Ground staff, Ticketing, Reservation, Cabin crew, Back Office, Hospitality Tourism, Front Office, Airport, Airport Security, Ticketing, Airlines, Reservations", "Jul 8, 2023 12:00:00 AM", "timesjobs", "0 - 3 yrs"], ["Sales and Dispatch Executive", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=RWXElRxROY1zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "Airport jobs in all StateHR MR Aman Sharma 99533 90429 (Call And drop your cv on this WhatsApp 9953390429 )We are looking for candidates for Airport Ground Staff , ticket checking,cabin crew ect0 years of experience. Candidates who have prior experience in full TimeJob :- Airline Ground Staff job requires Responsibility, Ground Support Equipment, Ground Transportation, Airport Management, Flight Planning in skills.-High school equivalent qualification. Checking passengers in giving seat numbers Providing boarding passes and luggage labels. Telling passengers about luggage restrictions. Weighing baggage and collecting any excess weight charges. Taking care of people with special needs.CheckthisPost--Flight Steward, HR, Cashier, Supervisor, Manager , Announcer, Air Ticketing, Ground Handling, C.S.A, G.R.E, Welcome Loader, G.R.A, Tag Boy, Kitchen Steward. DATA entry, back office, HOUSEKEEPING, Floor Manager, Event Planner, Engineer, Transport Supervisor, Waiter/Steward. HR/Admin, Help Desk Executive ,FIRE FIGHTER , BARTENDER, AIR HOSTESS, Trainer, COOK, COUNSELLER, WAREHOUSE EXECUTIVE ,HR, MANAGER, SUPERVISOR, AIR TICKETING CASHIER ACCOUNTANTQualification-10th, 12th to Graduate (Hospitality, Aviation, must apply) and good Air-ticketing Executive Reservation Executive Passport Checking Staff Baggage/Security Guest Relationship Executive Customer Service Associate Cabin Crew Ground staff -Startingsalary 27500/- TO 49500/-EDUCATION DETAILS- 10th /12th PASS AND ABOVE CAN APPLYNOTE-> WE ARE NOT A CONSULTANCY>DIRECT COMPANY PAYROLLFULL-TIME PERMANENT Job details call airline HR Mr Aman Sharma call or follow the WhatsApp number 99533 90429", "HM Job Hub", "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", null, "Data Entry, Ground staff, Ticketing, Reservation, Cabin crew, Back Office, Hospitality Tourism, Front Office, Airport, Airport Security, Ticketing, Airlines, Reservations", "Jul 9, 2023 12:00:00 AM", "timesjobs", "0 - 3 yrs"], ["assistant  supervisor - air traffic management", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Juj0KQRkII1zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "Airport jobs in all StateHR MR prince Kapoor 9458190551 (Call And drop your cv on this WhatsApp 9458190551 )We are looking for candidates for Airport Ground Staff , ticket checking,cabin crew ect0 years of experience. Candidates who have prior experience in full TimeJob :- Airline Ground Staff job requires Responsibility, Ground Support Equipment, Ground Transportation, Airport Management, Flight Planning in skills.-High school equivalent qualification. Checking passengers in giving seat numbers Providing boarding passes and luggage labels. Telling passengers about luggage restrictions. Weighing baggage and collecting any excess weight charges. Taking care of people with special needs.CheckthisPost--Flight Steward, HR, Cashier, Supervisor, Manager , Announcer, Air Ticketing, Ground Handling, C.S.A, G.R.E, Welcome Loader, G.R.A, Tag Boy, Kitchen Steward. DATA entry, back office, HOUSEKEEPING, Floor Manager, Event Planner, Engineer, Transport Supervisor, Waiter/Steward. HR/Admin, Help Desk Executive ,FIRE FIGHTER , BARTENDER, AIR HOSTESS, Trainer, COOK, COUNSELLER, WAREHOUSE EXECUTIVE ,HR, MANAGER, SUPERVISOR, AIR TICKETING CASHIER ACCOUNTANTQualification-10th, 12th to Graduate (Hospitality, Aviation, must apply) and good Air-ticketing Executive Reservation Executive Passport Checking Staff Baggage/Security Guest Relationship Executive Customer Service Associate Cabin Crew Ground staff -Startingsalary 27500/- TO 49500/-EDUCATION DETAILS- 10th /12th PASS AND ABOVE CAN APPLYNOTE-> WE ARE NOT A CONSULTANCY>DIRECT COMPANY PAYROLLFULL-TIME PERMANENT Job details call airline HR Mr prince Kapoor call or follow the WhatsApp number 9458190551", "HM Job Hub", "Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR,  Gurgaon", null, "Data Entry, Ground staff, Ticketing, Reservation, Cabin crew, Back Office, Hospitality Tourism, Front Office, Airport, Airport Security, Ticketing, Airlines, Reservations", "Jul 9, 2023 12:00:00 AM", "timesjobs", "0 - 3 yrs"], ["Tamilnadu Guwahati Chennai Airport", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=8Yvj4__PLUS__bkjHBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "OB DESCRIPTIONAirport jobs in all StateHR MR Adithya rajendiran 8860538616 (Call And drop your cv on this WhatsApp 8860538616 )We are looking for candidates for Airport Ground Staff , ticket checking,cabin crew ect0 years of experience. Candidates who have prior experience in full Time Job :- Airline Ground Staff job requires Responsibility, Ground Support Equipment, Ground Transportation, Airport Management, Flight Planning inskills.-High school equivalent qualification. Checking passengers in giving seat numbers Providing boarding passes and luggage labels. Telling passengers about luggage restrictions. Weighing baggage and collecting any excess weight charges. Taking care of people with special needs.CheckthisPost--Flight Steward, HR, Cashier, Supervisor, Manager , Announcer, Air Ticketing, Ground Handling, C.S.A, G.R.E, Welcome Loader, G.R.A, Tag Boy, Kitchen Steward. DATA entry, back office, HOUSEKEEPING, Floor Manager, Event Planner, Engineer, Transport Supervisor, Waiter/Steward. HR/Admin, Help Desk Executive ,FIRE FIGHTER , BARTENDER, AIR HOSTESS, Trainer, COOK, COUNSELLER, WAREHOUSE EXECUTIVE ,HR, MANAGER, SUPERVISOR, AIR TICKETING CASHIER ACCOUNTANTQualification-10th, 12th to Graduate (Hospitality, Aviation, must apply) and good Air-ticketing Executive Reservation Executive Passport Checking Staff Baggage/Security Guest Relationship Executive Customer Service Associate Cabin Crew Ground staff -Starting salary27500/- TO 49500/-EDUCATION DETAILS- 10th /12th PASS AND ABOVE CAN APPLYNOTE-> WE ARE NOT A CONSULTANCY>DIRECT COMPANY PAYROLLFULL-TIME PERMANENT Job details call airline HR Miss Adithya rajendiran call or follow the WhatsApp number 8860538616JOB FUNCTION:HR/PM/IR/Training,Ticketing/Reservation/Travel Agent/AirlinesINDUSTRY:Hotel/Travel/Tourism/Airlines/Hospitality, Marine/Aviation/Military/Mining/ShippingSPECIALIZATION:Employee Relations,Air Hostess,Ground Staff,TicketingQUALIFICATION:Any GraduateEMPLOYMENT TYPE:Full TimeJOB POSTED BY COMPANYHM Job HubHiring for All India airport job domestic and international airport in this companyKEY SKILLSData EntryGround staffTicketingReservationCabin crewBack OfficeHospitality TourismFront OfficeAirportAirport SecurityTicketingAirlinesReservationsABOUT HIRING COMPANYCOMPANY:Ground staff and ticketing job in all India airportCONTACT DETAILS:8860538616EXECUTIVE NAME:MR Adithya rajendiran Report Job", "DK Associates", "Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Chandigarh,  Pondicherry/Puducherry", null, "Data EntryGround staffTicketingReservationCabin crewBack OfficeHospitality TourismFront OfficeAirportAirport SecurityTicketingAirlinesReservations", "May 30, 2023 12:00:00 AM", "timesjobs", "0 - 3 yrs"], ["Ground Staff directly vacancy", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=L2qanukzUd9zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "OB DESCRIPTIONAirlines HR Adeel shaik Mohammad -8826459387(Call & drop your CV on this number WhatsApp 8826459387 )WE are looking Candidates for Airport Different posts with 0 year to 3 yearsExperience candidates wo have prior experience in full time job,The Airlines Ground Staff job required Responsibility, Ground Staff Equipment, Ground Transportation, Airport Management, Flight Planning.Qualification:-10th Graduation/Any DiplomaChacking Passengers in given seat number, Providing Boarding pass & Luggage Labels, Telling passengers aboutLuggage restrictions, Weighting baggage and collecting any extra weight charges, Taking care of people with special needs.Contact HR :Adeel shaik Mohammad 8826459387Post Availability:- 8 types1.Air -Ticketing Executive2.Reserva Executive3.Passport4.-Baggage/Security5:-Guest Relationship Executive6:-Customer Service Associate7:-Cabin Crew 8:-Groun StaffSalary 25700 to37200Note:-We are not a Counsultancy directly Company Payroll Full AIRLINES. JOB FUNCTION:Administration,Ticketing/Reservation/Travel Agent/AirlinesINDUSTRY:Hotel/Travel/Tourism/Airlines/Hospitality, Marine/Aviation/Military/Mining/ShippingSPECIALIZATION:Office Management & Coordination,Air Hostess,Cabin Crew,Ground StaffROLE:Reservation/ Ticketing Manager, Air Hostess/ Flight Steward/ Cabin Crew, Air Traffic Controller, Ground Staff/ Ground AttendantQUALIFICATION: CA (Chartered Accountant), CS (Company Secretary), ICWA, M.Arch. (Architecture), M.Com. (Commerce), M.Ed. (Education), M.Pharm. (Pharmacy), M.Phil. (Philosophy), M.Sc. (Science), MA (Arts), MBA/ PGDM, MCA/ PGDCA, MD/ MS (Medicine), ME/ M.Tech./ MS (Engg/ Sciences), Master of Dental Surgery (MDS), ML/ LLM (Law)Any GraduateEMPLOYMENT TYPE:Full TimeVACANCIES:5000JOB POSTED BY COMPANYHarendra RecruitersCompany hiring fresher & experience candidates for domestic airportKEY SKILLSsupervisorcomputer supervisorData Entry OperatorAirport Handling Operation Ground HandlingAirport SecurityAdministration OfficerBack-office OperationsABOUT HIRING COMPANYCOMPANY:AirlinesCONTACT DETAILS:+91-8826459387EXECUTIVE NAME:Adeel shaik MohammadAirlines vacancy available for domestic airport", "DK Associates", "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Hyderabad/Secunderabad", null, "Ground Staff / Cabin Crew / Air Ticketing Executive8447843840", "Jul 8, 2023 12:00:00 AM", "timesjobs", "0 - 3 yrs"], ["Ground Handling And Ticketing for Airport -Freshers", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Euozn6d7HbJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "JOB DESCRIPTION Airport jobs in all State HR mr Adithya rajendiran 8860538616 (Call and drop your cv on this WhatsApp 8860538616) We are looking for candidates for Airport Ground Staff , ticket checking,cabin crew ect 0 years of experience. Candidates who have prior experience in Full Time job. The Airline Ground Staff job requires Responsibility, Ground Support Equipment, Ground Transportation, Airport Management, Flight Planning in skills.- High school diploma or equivalent qualification. Checking passengers in giving seat numbers Providing boarding passes and luggage labels. Telling passengers about luggage restrictions. Weighing baggage and collecting any excess weight charges. Taking care of people with special needs. Air-ticketing Executive Reservation Executive Passport Checking Staff Baggage/Security Guest Relationship Executive Customer Service Associate Cabin Crew Ground staffS Salary :- 27500/- TO 49500/- EDUCATION DETAILS- 10th /12th PASS AND ABOVE CAN APPLY NOTE-> WE ARE NOT A CONSULTANCY> DIRECT COMPANY PAYROLL FULL-TIME PERMANENT Job more details call airline HR mr Adithya rajendiran call or follow the WhatsApp number 8860538616 JOB FUNCTION:Front Office Staff/Secretarial/Computer Operator,Ticketing/Reservation/Travel Agent/Airlines INDUSTRY:Educational/Training, Hotel/Travel/Tourism/Airlines/Hospitality SPECIALIZATION:Front Office,Cabin Crew,Ground Staff,Ticketing QUALIFICATION: Any Graduate EMPLOYMENT TYPE:Full Time JOB POSTED BY COMPANY Airline avaition authority of India having for all India domestic and international airport KEY SKILLS Back OfficeGround staffCabin crewair hostessflight attendantAirlinesReservationsAirline TicketingDomestic TicketingTravel ConsultantSecurity Network", "DK Associates", "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Chandigarh,  Pondicherry/Puducherry", null, "Back OfficeGround staffCabin crewair hostessflight attendantAirlinesReservationsAirline TicketingDomestic TicketingTravel ConsultantSecurity Network", "Jul 8, 2023 12:00:00 AM", "timesjobs", "0 - 3 yrs"], ["Cabin crew fresher candidate , passport checker", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=2gVu3EM__PLUS__66JzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "JOB DESCRIPTIONAirport jobs in all StateHR Shruthi 8395083788We are looking for candidates for Airport Ground Staff , ticket checking,cabin crew ect0 years of experience. Candidates who have prior experience in full TimeJob :- Airline Ground Staff job requires Responsibility, Ground Support Equipment, Ground Transportation, Airport Management, Flight Planning in skills.-High school equivalent qualification. Checking passengers in giving seat numbers Providing boarding passes and luggage labels. Telling passengers about luggage restrictions. Weighing baggage and collecting any excess weight charges. Taking care of people with special needs.CheckthisPost--Flight Steward, HR, Cashier, Supervisor, Manager , Announcer, Air Ticketing, Ground Handling, C.S.A, G.R.E, Welcome Loader, G.R.A, Tag Boy, Kitchen Steward. DATA entry, back office, HOUSEKEEPING, Floor Manager, Event Planner, Engineer, Transport Supervisor, Waiter/Steward. HR/Admin, Help Desk Executive ,FIRE FIGHTER , BARTENDER, AIR HOSTESS, Trainer, COOK, COUNSELLER, WAREHOUSE EXECUTIVE ,HR, MANAGER, SUPERVISOR, AIR TICKETING CASHIER ACCOUNTANTQualification-10th, 12th to Graduate (Hospitality, Aviation, must apply) and good Air-ticketing Executive Reservation Executive Passport Checking Staff Baggage/Security Guest Relationship Executive Customer Service Associate Cabin Crew Ground staff -Startingsalary 27500/- TO 49500/-EDUCATION DETAILS- 10th /12th PASS AND ABOVE CAN APPLYNOTE-> WE ARE NOT A CONSULTANCY>DIRECT COMPANY PAYROLLFULL-TIME PERMANENT Job details call airline HR Shruthi 8395061749", "Ram Ji", "Ahmedabad,  Bengaluru / Bangalore,  Gulbarga,  Hubli,  Mangalore", null, "Airport Handling Operation Ground Handling, cabin crew, air ticketing, Aircraft Maintenance, air cargo, freshers, Back Office Operations, aviation, airport", "Jul 8, 2023 12:00:00 AM", "timesjobs", "0 - 3 yrs"], ["Urgent Hiring 10th pass loading unloading", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=PtgGW00QzFlzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "JOB DESCRIPTIONAirport jobs in all StateHR Mr Adeel shaik Mohammad 8826459387 (airline HR)(Call And drop your cv on this WhatsApp 8826459387)We are looking for candidates for Airport Ground Staff , ticket checking,cabin crew ect0 years of experience. Candidates who have prior experience inFull Time job. The Airline Ground Staff job requires Responsibility, Ground Support Equipment, Ground Transportation, Airport Managementskills.-Highschool diploma or equivalent qualification. Checking passengers in giving seat numbers Providing boarding passes and luggage labels. Telling passengers about luggage restrictions. Weighing baggage and collecting any excess weight charges. Taking care of people with special needs.Check thisPost:--Cabin crew, Flight Steward, HR, Cashier, Supervisor, Manager , Announcer, Air Ticketing, Ground Handling, C.S.A, G.R.E, Welcome Loader, G.R.A, Tag Boy, Kitchen Steward. DATA entry, back office, HOUSEKEEPING, Floor Manager, Event Planner, Engineer, Transport Supervisor, Waiter/Steward. HR/Admin, Help Desk Executive ,FIRE FIGHTER , BARTENDER, AIR HOSTESS, Trainer, COOK, COUNSELLER, WAREHOUSE EXECUTIVE ,HR, MANAGER, SUPERVISOR, AIR TICKETING CASHIER ACCOUNTANTQualification: -10th, 12th to Graduate (Hospitality, Aviation, must apply) and good Air-ticketing Executive Reservation Executive Passport Checking Staff Baggage/Security Guest Relationship Executive Customer Service Associate Cabin Crew Ground staffSSalary :- 27500/- TO 49500/-EDUCATION DETAILS- 10th /12th PASS AND ABOVE CAN APPLYNOTE-> WE ARE NOT A CONSULTANCY> DIRECT COMPANY PAYROLL FULL-TIME PERMANENT Jobmore details call airlineHR Mr Adeel shaik Mohammad call or follow the WhatsApp number 8826459387JOB FUNCTION:Front Office Staff/Secretarial/Computer Operator,Ticketing/Reservation/Travel Agent/AirlinesINDUSTRY:Educational/Training, Hotel/Travel/Tourism/Airlines/HospitalitySPECIALIZATION:Front Office,Cabin Crew,Ground Staff,TicketingQUALIFICATION:Any GraduateEMPLOYMENT TYPE:Full TimeJOB POSTED BY COMPANYhaving for all India domestic and international airportKEY SKILLSBack OfficeGround staffCabin crewair hostessflight attendantAirlinesReservationsAirline TicketingDomestic TicketingTravel ConsultantSecurity NetworkABOUT HIRING COMPANYCOMPANY:Domestic and international airportCONTACT DETAILS:8826459387EXECUTIVE NAME:Adeel shaik Mohammad", "DK Associates", "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Kolkata", null, "Back OfficeGround staffCabin crewair hostessflight attendantAirlinesReservationsAirline Ticketing", "Jul 8, 2023 12:00:00 AM", "timesjobs", "0 - 3 yrs"], ["SAP SD", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Yk__PLUS__Zzabi__PLUS__39zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "SAP SD Specialist Role SAP SD consultant Understand business requirements and map them to a 'Business Process' in SAP Achieve client expected business resultsQualifications and Experience Graduate Engineer from reputed college At least 3 years of domain experience in Sales and Distribution Function At least 7 years of SAP SD experience Two full lifecycle SAP ERP implementation experience Experience in implementing/roll-out SAP ERP at large client engagement/in a multi-geography environment would be desirable Hands-on SAP SD configuration experience with focus on SD Sales Process, Enterprise structure, Sales Order processing, Scheduling Agreements, Delivery & Shipping processes, Pricing Process, Debit & Credit Memo and Returns Processing Credit Management, Integration of SD with other modules, Extensive work experience on diverse environments having multiple interfaces with SAP is must Experience and knowledge of key integration points between SAP modules Highly proficient using Microsoft products (SharePoint, Excel, Word, Outlook).", "GFORCE CONSULTING SOLUTIONS OPC PVT LTD", "Bengaluru / Bangalore,  Delhi,  Kolkata,  Mumbai", null, "SAP, SAP SD, SAP ERP", "Jul 9, 2023 12:00:00 AM", "timesjobs", "6 - 9 yrs"], ["Airpots ,1,Jobs ,Apply now,2023,Se", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=bQ4CWF0BjKJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "HIRING FOR AIRLINESAGE LIMIT : 18 - 50 ) ( You Can Call Me Or Drop Your Resume,CV,Bio Data On Same Whatsapp Number)CALL ME - Rahul CONTECT NUMBER -. +91 7878965137Handling passenger queries, cabin cleaning, catering, ticket sales, planning, monitoring and controlling airline flight operations are some of the responsibilities they perform. They are also responsible for complying with regulatory requirements and making each flight execution flawless and on-time.. Checking passengers in giving seat numbers. Providing boarding passes and luggage labels. Telling passengers about luggage restrictions. Weighing baggage and collecting any excess weight charges. Taking care of people with special needs, and unaccompanied direct.CALL ME - Rahul CONTECT NUMBER -. +91 7878965137( Call Or Drop Your Resume,Cv,Bio Data On Same Whatsapp Number )* Vacancies Available :- 1.Data Entry2.Store Incharge 3.Passport Checker4. Security Guard 5.Store Keeper6.Supervisor 7. Cabin Crew8. Ground staff SALARY:- 21500/- TO 45500/-> EDUCATION DETAILS:- 10th /12th PASS AND ABOVE CANDIDATE CAN APPLY NOTE:-> WE ARE NOT A CONSULTANCY > DIRECT COMPANY PAYROLL FULL-TIME PERMANENT JOB.Airlines Pvt Ltd IndustryAirline ServicesSize:1001 - 5000 EmployeesTurnover:2500 - 5000 Crores", "Priti Kailas Suryavanshi", "Bengaluru / Bangalore,  Bidar,  Davanagere,  Dharwad,  Gulbarga", null, "Payroll, Employee, Management, Marketing, software engineer, developer, web developer, php programmer, ⁴", "Jul 9, 2023 12:00:00 AM", "timesjobs", "0 - 3 yrs"], ["Opening for Fusion HCM Technical Consultant", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=awWWrfXfwVhzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "Role: Oracle Cloud HCM Techno-functional with implementation experience of Core HR, Payroll, OTL, Absence, Compensation &BenefitsLocation: BengaluruRequired Experience:Techno Functional consultant with minimum of 4+ years of experience should have Experience in Oracle HCM Cloud implementation & support in Core HR, Payroll, Absence, Compensation and Benefits. Worked in 3 or more Oracle HCM Cloud implementation or support projects as a Techno Functional consultant. Sound hands-on experience in Fast Formula, BI & OTBI Reports, Value Set, UDT and Personalization & Customizations and Workflow. Must have worked in client facing role and worked on Req. Gathering, Product Workshop & Demo, CRP, UAT etc. Should have excellent communication, Project/stakeholder/team management skills and experience. Needs to demonstrate good understanding of Business processes Mandatory Technical Skills: Desired to have technical knowledge in Oracle HCM Cloud security, Reporting, Data Migration and Interface/Integration development using HDL, PBL, HCM Extract, BIP, Web Service etc. Reports and Analytics - knowledge on existing reports/ custom report creation method Analyze business requirements/processes and system integration points to determine appropriate technology solutions. Design, and documents applications based on system and user requirements. Understand data feed from feeder systems and design Interfaces for importing the data. Should be able to provide or drive the optimum solution for new initiatives. Should have good experience in Business Requirements gathering skills and good hands-on experience in preparing the Functional Design, Technical Design and Test Cases documents.Good knowledge and working experience in writing Fast FormulasGood knowledge of HCM table structures and data flowWorking experience in designing UDTs, Lookups & Worksheet dynamic columns", "LTIMindtree Ltd.", "Bengaluru / Bangalore,  Chennai,  Delhi/NCR,  Mumbai,  Pune", null, "Fusion HCM Technical, Cloud HCM Technical, SaaS HCM Technical, Fusion HCM Techno Functional, SaaS HCM Techno Functional, Cloud HCM Techno Functional", "Jul 9, 2023 12:00:00 AM", "timesjobs", "4 - 9 yrs"], ["Jobs,Urgent hiring training base vacancy,Airports ,On role", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Y3CAhfWkOWtzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "HIRING FOR AIRLINESAGE LIMIT : 18 - 50 ) ( You Can Call Me Or Drop Your Resume,CV,Bio Data On Same Whatsapp Number)CALL ME - Priti CONTECT NUMBER -. +91 9785084210Handling passenger queries, cabin cleaning, catering, ticket sales, planning, monitoring and controlling airline flight operations are some of the responsibilities they perform. They are also responsible for complying with regulatory requirements and making each flight execution flawless and on-time.. Checking passengers in giving seat numbers. Providing boarding passes and luggage labels. Telling passengers about luggage restrictions. Weighing baggage and collecting any excess weight charges. Taking care of people with special needs, and unaccompanied direct.CALL ME - Priti CONTECT NUMBER -. +91 9785084210( Call Or Drop Your Resume,Cv,Bio Data On Same Whatsapp Number )* Vacancies Available :- 1.Data Entry2.Store Incharge 3.Passport Checker4. Security Guard 5.Store Keeper6.Supervisor 7. Cabin Crew8. Ground staff SALARY:- 21500/- TO 45500/-> EDUCATION DETAILS:- 10th /12th PASS AND ABOVE CANDIDATE CAN APPLY NOTE:-> WE ARE NOT A CONSULTANCY > DIRECT COMPANY PAYROLL FULL-TIME PERMANENT JOB.Airlines Pvt Ltd IndustryAirline ServicesSize:1001 - 5000 EmployeesTurnover:2500 - 5000 Crores", "Priti Kailas Suryavanshi", "Bengaluru / Bangalore,  Bidar,  Davanagere,  Dharwad,  Gulbarga", null, "Payroll, Employee, Management, Marketing, software engineer, developer, web developer, php programmer, ⁴", "Jul 9, 2023 12:00:00 AM", "timesjobs", "0 - 3 yrs"], ["Restaurant General Manager", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=68yPFIfy__PLUS__BdzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "Core Responsibilities Include: Creating value for our shareholders through efficient operations, appropriate cost controls, and profit managementEffectively manage a Yum-owned restaurant within the policies and guidelines of the company, ensuring 100% customer satisfaction at all times.Controls day-to-day operations by scheduling manpower, ordering food and supplies, and developing the restaurant teamControls profit & loss, by following cash control/security procedures, maintaining inventory, managing labor, reviewing financial reports, and taking appropriate actionsInterviews and hires team members, conducts performance appraisals, takes discipline action, motivates and trainsEnsures maintenance of equipment, facility, and grounds through the use of a preventative maintenance programEnsures food quality and 100% customer satisfactionEnsures complete and timely execution of corporate & local marketing programsEnsures a safe working and customer experience environment by facilitating safe work behaviors of the teamChampions recognition and motivation effortsThe ideal candidate for the Restaurant General Manager position will posse: Passion for hospitalityPeople Focus: training & developmentCustodian of CultureThirst for KnowledgeDedication to providing exceptional customer serviceGraduate (any stream) or 3 yrs Degree / Diploma in Hotel ManagementCore Responsibilities Include:Process ChampionClosing & Opening of the restaurants marketing plansRostering for team membersChampions recognition and motivation effortsMaintaining fast, accurate service, positive guest relations, and ensuring products are consistent with company quality standardsmaintaining inventoryEnsures company standards on equipment, facility, and grounds are maintained by using a preventative maintenance programEnsures food quality and 100% customer satisfaction", "AppSoft Solutions", "Bengaluru / Bangalore,  Delhi,  Gurgaon,  Mumbai,  Pune", null, "Hospitality, Customer Handling, Restaurant Management, Hotel Management, Quick Service Restaurant, Store Operations, Customer Service, Retail Sales", "Jul 9, 2023 12:00:00 AM", "timesjobs", "1 - 6 yrs"], ["Receptionist", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=ez0OBK0CvNJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "Receptionist Job Responsibilities:Serves visitors by greeting, welcoming, and directing them appropriately.Notifies company personnel of visitor arrival.Maintains security and telecommunications system.Informs visitors by answering or referring inquiries.Directs visitors by maintaining employee and department directories.Maintains security by following procedures, monitoring logbook, and issuing visitor badges.Operates telecommunication system by following manufacturers instructions for house phone and console operation.Keeps a safe and clean reception area by complying with procedures, rules, and regulations.Supports continuity among work teams by documenting and communicating actions, irregularities, and continuing needs.Contributes to team effort by accomplishing related results as needed.", "AppSoft Solutions", "Bengaluru / Bangalore,  Delhi,  Hyderabad/Secunderabad,  Mumbai,  Pune", null, "Front Desk, front desk executive, Receptionist, front office executive, Verbal Communication, Customer Focus, Office-mgmt", "Jul 9, 2023 12:00:00 AM", "timesjobs", "0 - 3 yrs"], ["Cyber Security Engineer - (DAST and Penetration Testing)", "http://www.timesjobs.com/candidate/JobDetailView.html?adId=nlb2o2TmqG1zpSvf__PLUS__uAgZw==&bc=EXT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "Proven expertise & track record in Web and Mobile application Penetration testing (Web, Mobile, API/Web Services on JAVA & .Net) through DAST Manual approach. Hands-on experience in DAST tools (Acunetix/Burpsuite/Appscan etc), API (SOAPUI, PostMan). Experience in DAST Manual Assessments, Threat Model creation and Penetration Testing. Network Pentest skills-sets for external and internal networks. Hands-on experience on DevSecOps (Concourse/Jenkins). Excellent written and verbal communication skills. Good Knowledge of Java, .NET, SQL queries (Oracle, PostgreSQL etc). Experience in Automating Security tasks using Python or Java Frameworks and System/Network Exploitation is a bonus. Experience in Red Teaming is a bonus.", "ArisGlobal LLC", "Mysoru / Mysore,  Bengaluru / Bangalore", null, "security, java, postgresql, api, python, oracle, mobile, .net", "Jun 13, 2023 12:00:00 AM", "timesjobs", "2 - 5 yrs"]]